In [1]:
import pandas as pd

In [ ]:
titanic= pd.read_csv("titanic.csv",sep=",") #prametro de separador

In [ ]:
titanic.head() # 5 primeiras linhas

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
titanic.tail()#ultimas linhas

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [14]:
titanic["Name"].head(10)

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [8]:
titanic.Name.head(15)

0                               Braund, Mr. Owen Harris
1     Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                Heikkinen, Miss. Laina
3          Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                              Allen, Mr. William Henry
5                                      Moran, Mr. James
6                               McCarthy, Mr. Timothy J
7                        Palsson, Master. Gosta Leonard
8     Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                   Nasser, Mrs. Nicholas (Adele Achem)
10                      Sandstrom, Miss. Marguerite Rut
11                             Bonnell, Miss. Elizabeth
12                       Saundercock, Mr. William Henry
13                          Andersson, Mr. Anders Johan
14                 Vestrom, Miss. Hulda Amanda Adolfina
Name: Name, dtype: object

In [12]:
print(titanic.shape)
print(titanic.index)

(891, 12)
RangeIndex(start=0, stop=891, step=1)

In [13]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [16]:
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [22]:
#FILTROS
TipoNum = (titanic.dtypes ==  "object")
print(TipoNum)

PassengerId    False
Survived       False
Pclass         False
Name            True
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [23]:
colNumericas = titanic.dtypes[TipoNum].index
print(colNumericas)

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [24]:
titanic[colNumericas].head()

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S

In [25]:
colunas_selecionadas = ["PassengerId","SibSp","Parch"]
titanic[colunas_selecionadas].head()

   PassengerId  SibSp  Parch
0            1      1      0
1            2      1      0
2            3      0      0
3            4      1      0
4            5      0      0

Como retornamos um DataFrame com todas as colunas menos a última?

In [ ]:
titanic[:-1] #todo o dataframe
titanic.columns[:-1] # só as colunas

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin'],
      dtype='object')

In [ ]:
titanic.iloc[:,:-1].head() #iloc seleciona os indices por linha e coluna
titanic.iloc[15:,:3].head()

In [32]:
titanic.loc[:,["Survived","Name"]].head()#loc seleciona pelo nome da coluna

   Survived                                               Name
0         0                            Braund, Mr. Owen Harris
1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1                             Heikkinen, Miss. Laina
3         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4         0                           Allen, Mr. William Henry

In [33]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [ ]:
titanic.describe(include="all") #valores de todas as colunas

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Braund, Mr. Owen Harris",male,NaN,NaN,NaN,347082,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [34]:
titanic.Age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [40]:
titanic["Age"].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [ ]:
titanic.loc[:,["Age","Pclass"]].describe()
titanic[["Age","Pclass"]].describe()

              Age      Pclass
count  714.000000  891.000000
mean    29.699118    2.308642
std     14.526497    0.836071
min      0.420000    1.000000
25%     20.125000    2.000000
50%     28.000000    3.000000
75%     38.000000    3.000000
max     80.000000    3.000000

In [ ]:
titanic["Age"].mean()#estatistica de uma só coluna

Importe as colunas ‘crim’ e ‘medv’ do dataset BostonHousing.
Mostre somente as primeiras 14 linhas.

In [46]:
boston = pd.read_csv("BostonHousing.csv")
boston.loc[:13,["crim","medv"]]

       crim  medv
0   0.00632  24.0
1   0.02731  21.6
2   0.02729  34.7
3   0.03237  33.4
4   0.06905  36.2
5   0.02985  28.7
6   0.08829  22.9
7   0.14455  27.1
8   0.21124  16.5
9   0.17004  18.9
10  0.22489  15.0
11  0.11747  18.9
12  0.09378  21.7
13  0.62976  20.4

In [ ]:
boston[["crim","medv"]].head(14)

       crim  medv
0   0.00632  24.0
1   0.02731  21.6
2   0.02729  34.7
3   0.03237  33.4
4   0.06905  36.2
5   0.02985  28.7
6   0.08829  22.9
7   0.14455  27.1
8   0.21124  16.5
9   0.17004  18.9
10  0.22489  15.0
11  0.11747  18.9
12  0.09378  21.7
13  0.62976  20.4

In [47]:
titanic.Embarked.unique() #valores unicos

array(['S', 'C', 'Q', nan], dtype=object)

In [49]:
titanic.Age.value_counts()# contagem de qnts vezes os valores aparecem

Age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [66]:
new = titanic.dropna()# exclui todas as linhas com nan
#print(titanic.isna().head(15))
print(titanic.isna().sum())#conta os valores verdadeiros
new.shape

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

(183, 12)

In [68]:
y = titanic.Age.fillna(titanic["Age"].mean())#preenchendo os na com a media na coluna Age
print(y.head(15))
z= titanic.fillna(200)#preenchendo na com valor 200 em todas as colunas vazia

0     22.000000
1     38.000000
2     26.000000
3     35.000000
4     35.000000
5     29.699118
6     54.000000
7      2.000000
8     27.000000
9     14.000000
10     4.000000
11    58.000000
12    20.000000
13    39.000000
14    14.000000
Name: Age, dtype: float64

In [69]:
print(round(titanic.groupby("Embarked").mean()["Age"].sort_values()["S"],5))#separa os valores de embarked;.mean()-> media de idade do grupo S

TypeError: agg function failed [how->mean,dtype->object]

In [70]:
#varios filtros de uma vez

rico = titanic["Pclass"] == 1
sobreviveu = titanic["Survived"] == 1
titanic[rico & sobreviveu ].describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,136.000000,136.0,136.0,122.000000,136.000000,136.000000,136.000000
mean,491.772059,1.0,1.0,35.368197,0.492647,0.389706,95.608029
std,239.006988,0.0,0.0,13.760017,0.632412,0.690387,85.286820
min,2.000000,1.0,1.0,0.920000,0.000000,0.000000,25.929200
25%,307.750000,1.0,1.0,24.250000,0.000000,0.000000,50.985450
50%,510.500000,1.0,1.0,35.000000,0.000000,0.000000,77.958300
75%,693.500000,1.0,1.0,45.000000,1.000000,1.000000,111.481225
max,890.000000,1.0,1.0,80.000000,3.000000,2.000000,512.329200

E se quisermos um filtro que retorne os registros com os passageiros da primeira
classe que sobreviveram
1.13 e os passageiros da terceira classe que não sobreviveram?

In [77]:
#filtro = (titanic["Pclass" == 1 ] & titanic["Survived"] ==1) | (titanic["Pclass"]==3 & titanic["Survived"]==0)
#titanic[((titanic["Pclass" == 1 ] & titanic["Survived"] ==1) | (titanic["Pclass"]==3 & titanic["Survived"]==0))].head() -> () foi o erro
filtro = (
(titanic["Pclass"] == 1) & (titanic["Survived"] == 1) |
(titanic["Pclass"] == 3) & (titanic["Survived"] == 0)
)
titanic[filtro].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q